Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Parentheses in Perl 6 are always optional in a control construct such as C<if()>, C<while()>, or C<when()>; they can't be made optional in Perl 5 without a great deal of potential confusion, because Perl 5 would parse the expression
es_es: Los paréntesis en Perl 6 son siempre opcionales en construcciones de control, como en C<if()>, C<while()>, o C<when()>; no pueden ser opcionales en Perl 5, sin ganar una gran confusión, porque Perl 5 interpretaría la expresión

source: =item redo LABEL X<redo>
es_es: =item redo ETIQUETA X<redo>

source: While running Configure and when building, you are likely to get quite a few of these warnings:
es_es: Mientras ejecuta Configure y cuando compile, es probable que obtenga un buen número de estas advertencias:

source: C<redo> cannot be used to retry a block that returns a value such as C<eval {}>, C<sub {}>, or C<do {}>, and should not be used to exit a grep() or map() operation.
es_es: C<redo> no puede usarse para reiniciar un bloque que devuelve un valor, como C<eval {}>, C<sub {}> o C<do {}>, y no debe ser usado para salir de una operación grep() o map().

source: Due to the multiplicity of floating-point formats and the lack of a standard "network" representation for them, no facility for interchange has been made.
es_es: Debido a la multiplicidad de formatos de punto flotante y la falta de una norma de representación en la "red" para ellos, no hay ninguna facilidad para el intercambio de datos.

source: say "I don't like oranges." when /oranges?;
es_es: say "No me gustan las naranjas." when /naranjas?/;

source: C<Switch> upgraded to version 2.10_01
es_es: C<Switch> actualizado a la versión 2.10_01

source: If you wanted there I<not> to be an @AoA, but rather just a reference to it, you could do something more like this:
es_es: Si I<no> quiere que sea un @AoA, sino una referencia a él, puede hacer algo más parecido a esto:

source: It is similar to the command line mode of the L<CPAN> module,
es_es: Es similar al modo de línea de comandos del módulo L<CPAN>,

source: =head2 Assertions
es_es: =head2 Aserciones

source: will have exactly the opposite restrictions.
es_es: tendrá exactamente las restricciones contrarias.

source: This is the most important part of this tutorial.
es_es: Ésta es la parte más importante del tutorial.

source: (In scalar context, returns the number of values.)
es_es: (En contexto escalar, devuelve el número de valores.)

source: =item study SCALAR X<study>
es_es: =item study ESCALAR X<study>

source: The C<s///> substitution operator is documented in L<perlop>.
es_es: El operador de sustitución, C<s///>, se describe en L<perlop>.

source: All filter methods return the existing filter, if present, or C<undef> if not.
es_es: Todos los métodos de filtro devuelven el filtro, si existe; de lo contrario, devuelven C<undef>.

source: \cK control char (example: VT)
es_es: \cK carácter de control (ejemplo: VT)

source: Line numbers displayed by diagnostics are internally stored as short integers, so they are limited to a maximum of 65535 (higher numbers usually being affected by wraparound).
es_es: Por otra parte, los números de línea especificados por los diagnósticos se almacenan internamente como enteros cortos, por lo que están limitados a un máximo de 65535 (cifras más altas quedarán afectadas por el desbordamiento).

source: Tutorials, end-user documentation, research papers, FAQs etc are not appropriate in a module's main documentation.
es_es: Manuales, documentación de usuario final, documentos de investigación, P+F (I<FAQ>), etc, no son apropiadas en la documentación principal de un módulo.

source: Perl's regular expression support is both broad and deep, and is the subject of lengthy documentation in L<perlrequick>, L<perlretut>, and elsewhere.
es_es: El soporte de Perl para las expresiones regulares es amplio y profundo, y se describe en gran detalle en los documentos L<perlrequick> y L<perlretut>, entre otros.

source: Don't fall into the trap of using a C<printf> when a simple C<print> would do.
es_es: No caiga en la trampa de utilizar un C<printf> cuando un simple C<print> valdría.

source: Binary "and" returns the logical conjunction of the two surrounding expressions.
es_es: Binario "and" devuelve la conjunción lógica de las dos expresiones que la rodean.

source: Be careful if you put double quotes around the picture, because an C<@> character may be taken to mean the beginning of an array name.
es_es: Tenga cuidado si pone dobles comillas alrededor del cuadro, porque un carácter C<@> puede ser tomado como el comienzo del nombre de un array.

source: The TEMPLATE is a sequence of characters that give the order and type of values, as follows:
es_es: La PLANTILLA es una secuencia de caracteres que dan el orden y el tipo de los valores, de la siguiente manera:

source: For example, the following computes the same number as the System V sum program:
es_es: Por ejemplo, lo siguiente calcula el mismo número que el programa sum de System V:

source: If C<use locale> is in effect and POSIX::setlocale() has been called, the character used for the decimal separator in formatted floating-point numbers is affected by the LC_NUMERIC locale.
es_es: Si C<use locale> está en vigor y POSIX::setlocale() ha sido llamado, el carácter utilizado para el separador decimal en formato de punto flotante de los números se ve afectada por la configuración regional LC_NUMERIC.

source: Fixes a bug in C<colored> when C<$EACHLINE> is set that caused it to not color lines consisting solely of 0 (literal zero).
es_es: Corrige un error en C<colored> cuando C<$EACHLINE> está activado, que provocaba que las líneas compuestas únicamente de ceros (cero literal) no se colorearán.

source: =item Naming conventions
es_es: =item Convenciones de nombres

source: Returns the natural logarithm (base I<e>) of EXPR.
es_es: Devuelve el logaritmo natural (base I<e>) de EXPR.

source: %hash = ( $key => $value );
es_es: %hash = ( $clave => $valor );

source: when ("foo") { ++$count }
es_es: when ("foo") { ++$cuenta }

source: perlpolicy Perl development policies
es_es: perlpolicy Directivas de desarrollo de Perl

source: the pattern uses a Unicode property (C<\p{...}>)
es_es: el patrón utiliza una propiedad Unicode (C<\p{...}>)

source: Like C<(*PRUNE)>, this verb always matches, and when backtracked into on failure, it causes the regex engine to try the next alternation in the innermost enclosing group (capturing or otherwise).
es_es: Al igual que C<(*PRUNE)>, este verbo siempre coincide, y cuando se hace vuelta atrás a causa de un fallo, hace que el motor de expresiones regulares trate la alternativa siguiente en el grupo más interno (de captura o de otra manera).

source: The format of the intervening text is described in L<perlpod>.
es_es: El formato del texto intermedio está descrito en L<perlpod>.

source: printf '<%.*d>', 0, 0; # prints "<>"
es_es: printf '<%.*d>', 0, 0; # imprime "<>"

source: C<unpack()> will default to unpacking the C<$_>.
es_es: C<unpack()> desempaquetará, por defecto, C<$_>.

source: Perl builtin functions that may behave differently under EBCDIC are mentioned in the perlport.pod document.
es_es: Las funciones Perl integradas que pueden comportarse de manera diferente en EBCDIC se mencionan en el documento perlport.pod.

source: Usually, the C<sprintf>, C<printf>, or the C<POSIX::floor> and C<POSIX::ceil> functions will serve you better than will int().
es_es: Usualmente, las funciones C<sprintf>, C<printf>, o C<POSIX::floor> y C<POSIX::ceil> le servirán mejor que int().

source: Binary distributions for some proprietary platforms can be found http://www.cpan.org/ports/ directory.
es_es: En el directorio http://www.cpan.org/ports/ encontrará distribuciones binarias para algunas plataformas comerciales.

source: With format C<b>, the first character of the 8-tuple determines the least-significant bit of a character; with format C<B>, it determines the most-significant bit of a character.
es_es: Con el formato C<b>, el primer carácter de la 8-tupla determina el bit menos significativo de un carácter; con el formato C<B>, se determina el bit más significativo de un carácter.

source: Since it's a common mistake to use C<exec> instead of C<system>, Perl warns you if there is a following statement that isn't C<die>, C<warn>, or C<exit> (if C<-w> is set--but you always do that, right?).
es_es: Como es un error normal usar C<exec> en lugar de C<system>, Perl le avisará si hay alguna instrucción a continuación que no sea C<die>, C<warn> o C<exit> (si C<-w> está puesto -pero usted, siempre lo tiene así, ¿verdad?-).

source: C<FindBin> upgraded to version 1.47
es_es: C<FindBin> actualizado a la versión 1.47

source: If MODE is C<<< >> >>>, the file is opened for appending, again being created if necessary.
es_es: Si MODO es C<<< >> >>>, el archivo es abierto en modo añadir, y de nuevo, será creado si es necesario.

source: This means that you can, without fear of conflict, use the same name for a scalar variable, an array, or a hash--or, for that matter, for a filehandle, a directory handle, a subroutine name, a format name, or a label.
es_es: Esto significa que usted puede, sin temor a conflictos, utilizar el mismo nombre para una variable escalar, un array o un hash; o, por la misma razón, para un identificador de archivo, un identificador de directorio, el nombre de una subrutina, un nombre de formato o una etiqueta.

source: The F<perlivp> program is set up at Perl source code build time to test the Perl version it was built under.
es_es: El programa F<perlivp> se configura en tiempo de compilación del código fuente de Perl para comprobar la versión de Perl con la que se generó.

source: Starting from the beginning of the input string, each 8-tuple of characters is converted to 1 character of output.
es_es: A partir del comienzo de la cadena de entrada, cada 8-tupla de caracteres se convierte en un carácter de la salida.

source: It's easiest to make a local copy of the reference before any manipulations.
es_es: Es más fácil hacer una copia local de la referencia antes de cualquier manipulación.

source: Currently, the rules to determine where the C<code> ends are somewhat convoluted.
es_es: En la actualidad, las reglas para determinar el lugar donde C<código> termina son algo enrevesadas.

source: One-line BLOCK may be put on one line, including curlies.
es_es: Un BLOQUE de una sola línea puede ser puesto en una sola línea, incluyendo sus llaves.o

source: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\010/ # \010 is octal
es_es: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\010/ # \010 es octal

source: Or maybe they need very serious hand-holding and contractual obligations.
es_es: O puede ser que tengan obligaciones contractuales o por acuerdos que limiten su libertad de elección.

source: If you want your here-docs to be indented with the rest of the code, you'll need to remove leading whitespace from each line manually:
es_es: Si quiere que su documento incrustado esté indentado con el resto del código, tendrá que quitar los espacios en blanco sobrantes de cada línea manualmente:

source: (See C<tie>.) Has no effect if the variable is not tied.
es_es: (Ver C<tie>). No tiene efecto si la variable no está enlazada.

source: README files and changelogs for CPAN modules bundled with perl are no longer installed.
es_es: Los archivos README y registros de cambios de los módulos de CPAN incluidos con perl ya no son instalados.

source: Exit status of C<pod2usage> fixed
es_es: Arreglado el estado de la salida de C<pod2usage>

source: And if there are multiple ways it might succeed, you need to understand backtracking to know which variety of success you will achieve.
es_es: Y si hay múltiples maneras en las que podría tener éxito, necesita entender la marcha atrás para saber qué variedad de éxitos va a lograr.

source: delete $HASH{$key};
es_es: delete $HASH{$clave};

source: A kill() method is available for thread signalling.
es_es: Un método kill() está disponible para la señalización en hilos.

source: If your routine iterates through some kind of list (such as a list of files, or records in a database) you may consider providing a callback so that users can manipulate each element of the list in turn.
es_es: Si la rutina se repite a través de algún tipo de lista (por ejemplo, una lista de archivos o registros en una base de datos), puede considerar la posibilidad de una retrollamada (I<callback>) para que los usuarios puedan manipular cada elemento de la lista cada vez.

source: =head2 @- and @+ in patterns
es_es: =head2 @- y @+ en patrones

source: SEE ALSO
es_es: VER TAMBIÉN

source: The simplest two-level data structure to build in Perl is an array of arrays, sometimes casually called a list of lists.
es_es: La estructura de datos a dos niveles más simple que se puede construir en Perl es un array de array, llamada en algunas ocasiones lista de listas.

source: Here's some advice: supply a creation mode of C<0666> for regular files (in C<sysopen>) and one of C<0777> for directories (in C<mkdir>) and executable files.
es_es: He aquí algunos consejos: suministre un modo de creación de C<0666> para archivos regulares (en C<sysopen>) y uno de C<0777> para directorios (en C<mkdir>) y los archivos ejecutables.

source: Any Any string equality $a eq $b
es_es: Cualquiera Cualquiera igualdad de cadenas $a eq $b

source: my $answer = 42;
es_es: my $respuesta = 42;

# or die "Can't open $file: $! ";
source: or die "Can't open $file: $!\n";
es_es: or die "No puedo abrir $archivo: $!\n";

source: =head2 Who supports Perl?
es_es: =head2 ¿Quién respalda a Perl?

source: See L<IPC::Open2>, L<IPC::Open3>, and L<perlipc/"Bidirectional Communication with Another Process"> for examples of such things.
es_es: Ver L<IPC::Open2>, L<IPC::Open3>, y L<perlipc/"Comunicación Bidireccional con otro proceso"> para ejemplos de estas cosas.

source: ### next always comes here
es_es: ### next siempre viene aquí

source: Starting with Perl 5.14, C<pop> can take a scalar EXPR, which must hold a reference to an unblessed array.
es_es: A partir de Perl 5.14, C<pop> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: last; # can't go to outer :-(
es_es: last; # no puedo volver al bucle más externo :-(

source: with Foreword by Larry Wall
es_es: con prólogo de Larry Wall

source: When of the form C<\N{NAME}>, it matches the character or character sequence whose name is C<NAME>; and similarly when of the form C<\N{U+I<hex>}>, it matches the character whose Unicode code point is I<hex>.
es_es: Cuando es de la forma C<\N{NOMBRE}>, coincide con el carácter o secuencia de caracteres cuyo nombre es C<NOMBRE>; y de manera similar cuando es de la forma C<\N{U+I<hex>}>, coincide con el carácter cuyo punto de código Unicode es I<hex>.

source: "aa\x08" =~ /${a}0/; # True!
es_es: "aa\x08" =~ /${a}0/; # ¡Verdadero!

source: C<File::Copy> now detects Unix compatibility mode on VMS.
es_es: C<File::Copy> ahora detecta el modo de compatibilidad Unix, en VMS.

source: while ($paragraph =~ /($sentence_rx)/g) {
es_es: while ($parrafo =~ /($sentencia_rx)/g) {

source: Math::BigInteger uses an external C library
es_es: Math::BigInteger usa una biblioteca C externa

source: Receives a message on a socket.
es_es: Recibe un mensaje de un socket.

source: is whatever you can justify on the basis of media cost, duplication charges, time of people involved, and so on.
es_es: es lo que puede justificar en función de los costes medios de comunicación, gastos de duplicación, tiempo de las personas involucradas, y así sucesivamente.

source: In a reciprocal fashion, an operation provides either a scalar or a list context to each of its arguments.
es_es: De forma recíproca, cualquier operación establece un contexto escalar o un contexto de lista para cada uno de sus argumentos.

source: 1645 Irix 6.2 & 6.3 POSIX header file updates
es_es: 1645 Irix 6.2 & 6.3 POSIX actualizaciones de los ficheros cabecera

source: In Perl 5.8.0 there were about 69000 separate tests in about 700 test files, in Perl 5.9.0 there are about 77000 separate tests in about 780 test files.
es_es: En Perl 5.8.0 había alrededor de 69.000 pruebas distintas en alrededor de 700 archivos de prueba, en Perl 5.9.0 hay cerca de 77.000 pruebas distintas en alrededor de 780 archivos de prueba.

source: if (exists $ref->{A}->{B}->[$ix]) { }
es_es: if (exists $ref->{A}->{B}->[$i]) { }

source: a) the GNU General Public License as published by the Free
es_es: a) la Licencia General Pública GNU, publicada por la Free

source: printf '<%g>', 1; # prints "<1>"
es_es: printf '<%g>', 1; # imprime "<1>"

source: The only kind of simple statement is an expression evaluated for its side effects.
es_es: La única clase de instrucción simple que existe es una expresión evaluada para obtener unos efectos colaterales.

source: reset 'X'; # reset all X variables
es_es: reset 'X'; # reinicia todas las variables X

source: Scalar values can be used in various ways:
es_es: Los valores escalares se pueden usar de varias maneras:

source: =head2 sprintf() fixes
es_es: =head2 Arreglos en sprintf()

source: $obj->do_something(
es_es: $obj->hacer_algo(

source: perldoc Look up Perl documentation in Pod format
es_es: perldoc Consulta de la documentación de Perl en formato Pod

source: That's because this wouldn't work:
es_es: Porque si no, lo siguiente no funcionará:

source: But both are slower than assigning the empty list or undefining %HASH or @ARRAY, which is the customary way to empty out an aggregate:
es_es: Pero estos dos son más lentos que simplemente asignar una lista vacía o indefiniendo %HASH o @ARRAY, que es la forma normal de vaciar un agregado:

source: A slice of an empty list is still an empty list.
es_es: Una porción de una lista vacía es también una lista vacía.

source: FILEHANDLE may be an expression whose value can be used as an indirect filehandle, usually the real filehandle name or an autovivified handle.
es_es: IDENTIFICADOR_ARCHIVO puede ser una expresión cuyo valor puede ser usado como un identificador de archivo indirecto, normalmente el nombre real del identificador de archivo o un identificador autovivificado.

source: ISBN 978-0-596-52011-3 [5th edition June 2008]
es_es: ISBN 978-0-596-52011-3 [5ª edición - Junio de 2008]

source: =item open FILEHANDLE,MODE,EXPR
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,EXPR

source: format Something =
es_es: format Algo =

source: =item rmdir FILENAME X<rmdir> X<rd> X<directory, remove>
es_es: =item rmdir NOMBRE_DIRECTORIO X<rmdir> X<rd> X<directory, remove> X<directorio, eliminar>

source: Remember that the look-aheads are zero-width expressions--they only look, but don't consume any of the string in their match.
es_es: Recuerde que las aserciones consecuentes son expresiones de ancho cero: ellas solo miran, pero no utilizan ninguna parte de la cadena de caracteres en su coincidencia.

source: Takes the same flags as the system call of the same name.
es_es: Toma las mismas banderas que la llamada al sistema del mismo nombre.

source: For double-quoted strings, the quoting from C<\Q> is applied after interpolation and escapes are processed.
es_es: Para las cadenas con comillas dobles, el efecto de C<\Q> es aplicado después del procesado de la interpolación y el escapado.

source: scalar(@whatever) == $#whatever + 1;
es_es: scalar(@loquesea) == $#loquesea + 1;

source: unless (EXPR) BLOCK elsif (EXPR) BLOCK ... else BLOCK
es_es: unless (EXPR) BLOQUE elsif (EXPR) BLOQUE ... else BLOQUE

source: However, since the publishing of this book, by many known as "Camel III", the consensus of the naming of this functionality has moved from "discipline" to "layer".
es_es: Sin embargo, desde la publicación de este libro, conocido por muchos como "Camel III", el consenso sobre el nombre de esta funcionalidad se ha movido desde "disciplina" a "capa".

source: $hash{"$key\0"} = "$value\0";
es_es: $hash{"$clave\0"} = "$valor\0";

source: In contrast, C<a*ab> will match the same as C<a+b>, since the match of the subgroup C<a*> is influenced by the following group C<ab> (see L<"Backtracking">).
es_es: Por el contrario, C<a*ab> coincidirá igual que con C<a+b>, ya que la coincidencia del subgrupo C<a*> está influenciada por el texto del grupo siguiente C<ab> (vea L<"backtracking">).

source: You don't normally need to worry about this unless you are writing a Perl debugger.
es_es: No necesita preocuparse de esto a menos que esté escribiendo un depurador Perl.

source: =item syswrite FILEHANDLE,SCALAR
es_es: =item syswrite IDENTIFICADOR_ARCHIVO,ESCALAR

source: =item telldir DIRHANDLE X<telldir>
es_es: =item telldir IDENTIFICADOR_DIR X<telldir>

source: Support for specific formats are available from CPAN as C<CPANPLUS::Dist::*> modules.
es_es: El código de compatibilidad con los distintos formatos específicos se encuentra en los módulos C<CPANPLUS::Dist::*> de CPAN.

source: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\10/ # \10 is octal
es_es: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\10/ # \10 es octal

source: Hashes have no particular internal order, though you can sort the keys and loop through them.
es_es: En los hashes no hay un orden interno específico, aunque puede ordenar las claves antes de recorrerlas en un bucle.

source: When reading, VAR must be a variable that will hold the data read.
es_es: Al leer, VAR debe ser una variable que contendrá los datos leídos.

source: perlpodspec Perl plain old documentation format specification
es_es: perlpodspec Especificación del formato POD

source: Or you might have had a temporary variable sitting around with the array in it.
es_es: O podría haber usado una variable temporal con el array en ella.

source: This means that one will be able to say
es_es: Esto significa que uno podrá decir

source: The level of detail in Perl module documentation generally goes from less detailed to more detailed.
es_es: El nivel de detalle en la documentación general del módulo Perl, va de menos a más detallada.

source: Math::BigIntFast Bit::Vector wrapper for big numbers
es_es: Math::BigIntFast envoltorio de Bit::Vector para grandes números

source: The conditional is true if any variables were assigned; that is, if the pattern matched.
es_es: La condición es verdadera si cualquiera de las variables fueron asignadas; es decir, si el patrón emparejó.

source: In I<getpw*()> the fields $quota, $comment, and $expire are special in that they are unsupported on many systems.
es_es: En I<getpw*()> los campos $cuota, $comentario y $expiracion son casos especiales en el sentido que en muchos sistemas no están soportados.

source: Starting with Perl 5.14, C<splice> can take scalar EXPR, which must hold a reference to an unblessed array.
es_es: A partir de Perl 5.14, C<splice> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: perlmpeix Perl notes for MPE/iX
es_es: perlmpeix Notas para MPE/iX

source: For example, many Perl books include a distribution of perl, as do the O'Reilly Perl Resource Kits (in both the Unix flavor and in the proprietary Microsoft flavor); the free Unix distributions also all come with perl.
es_es: Por ejemplo, muchos libros sobre Perl incluyen una distribución de perl, como los kits de recursos Perl publicados por O'Reilly (incluyen una versión para Unix y una versión comercial para sistemas Microsoft); las distribuciones gratuitas de Unix también incluyen perl.

source: Perl should now build on MirOS BSD.
es_es: Perl ahora debe compilarse en MirOS BSD.
